# Tap repositories and their packages
tap 'homebrew/dupes'
brew 'grep'

tap 'homebrew/versions'
brew 'lua52'

tap 'phinze/cask'
brew 'brew-cask'

tap 'rcmdnk/brewall'
brew 'brewall'


# Cask packages
cask 'bettertouchtool'
cask 'caffeine'
cask 'disk-inventory-x'
cask 'evernote'
cask 'firefox'
cask 'geektool'
cask 'gimp'
cask 'gitx'
cask 'keyremap4macbook'
cask 'kindle'
cask 'onyx'
cask 'the-unarchiver'
cask 'vlc'

# Other Homebrew packages
brew 'bash'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'emacs'
brew 'faac'
brew 'ffmpeg'
brew 'findutils'
brew 'fontconfig'
brew 'gdbm'
brew 'git'
brew 'lame'
brew 'libpng'
brew 'mplayer'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'readline'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'vim --override-system-vi'
brew 'wget --enable-iri'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'zsh'
