# Tap repositories and their packages
tap 'homebrew/dupes'

tap 'homebrew/versions'

tap 'rcmdnk/brewall'

# Cask packages
cask 'bettertouchtool'
cask 'coconutbattery'
cask 'disk-inventory-x'
cask 'evernote'
cask 'firefox'
cask 'gimp'
cask 'keyremap4macbook'
cask 'onyx'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'vlc'

# Other Homebrew packages
brew 'atk'
brew 'autoconf'
brew 'bash'
brew 'binutils'
brew 'brew-cask'
brew 'brewall'
brew 'cairo'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'diffutils'
brew 'emacs'
brew 'faac'
brew 'findutils --default-names'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'gnu-sed --default-names'
brew 'gnu-which'
brew 'gnutls'
brew 'gobject-introspection'
brew 'gpatch'
brew 'grep --default-names'
brew 'gtk+'
brew 'gzip'
brew 'harfbuzz'
brew 'icu4c'
brew 'jpeg'
brew 'less'
brew 'libevent'
brew 'libffi'
brew 'libidn'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'lua'
brew 'lua52'
brew 'm4'
brew 'make'
brew 'mplayer'
brew 'mutt'
brew 'nettle'
brew 'openssh'
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'screen'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tokyo-cabinet'
brew 'trash'
brew 'unzip'
brew 'watch'
brew 'wdiff --with-gettext'
brew 'wget --enable-iri'
brew 'xz'
brew 'zsh'
