# Tap repositories and their packages
tap 'homebrew/dupes'
brew 'grep'

tap 'homebrew/versions'
brew 'lua52'

tap 'phinze/cask'
brew 'brew-cask'

tap 'rcmdnk/brewall'
brew 'brewall'


# Cask packages
cask 'bettertouchtool'
cask 'caffeine'
cask 'coconutbattery'
cask 'disk-inventory-x'
cask 'evernote'
cask 'firefox'
cask 'geektool'
cask 'gimp'
cask 'keyremap4macbook'
cask 'onyx'
cask 'the-unarchiver'
cask 'vlc'

# Other Homebrew packages
brew 'atk'
brew 'bash'
brew 'cairo'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'emacs'
brew 'faac'
brew 'ffmpeg'
brew 'findutils'
brew 'fontconfig'
brew 'freetype'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'gobject-introspection'
brew 'gtk+'
brew 'harfbuzz'
brew 'icu4c'
brew 'jpeg'
brew 'lame'
brew 'libevent'
brew 'libffi'
brew 'libpng'
brew 'libtiff'
brew 'lua'
brew 'mplayer'
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'vim --override-system-vi, --with-perl, --with-mzscheme, --with-lua, --with-tcl, --with-client-server'
brew 'wget --enable-iri'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'zsh'
